Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_tcp_client/src/packs/WBZ653_DFP/component/rcon.h
/* -------- RCON_RCONSET : (RCON Offset: 0x68) (R/W 32)  -------- */
#define RCON_RCONSET_RESETVALUE               _UINT32_(0x00)                                       /*  (RCON_RCONSET)   Reset Value */

#define RCON_RCONSET_Msk                      _UINT32_(0x00000000)                                 /* (RCON_RCONSET) Register Mask  */


/* -------- RCON_RCONINV : (RCON Offset: 0x6C) (R/W 32)  -------- */
#define RCON_RCONINV_RESETVALUE               _UINT32_(0x00)                                       /*  (RCON_RCONINV)   Reset Value */

#define RCON_RCONINV_Msk                      _UINT32_(0x00000000)                                 /* (RCON_RCONINV) Register Mask  */


/* -------- RCON_RSWRST : (RCON Offset: 0x70) ( /W 32) SOFTWARE RESET REGISTER -------- */
#define RCON_RSWRST_RESETVALUE                _UINT32_(0x00)                                       /*  (RCON_RSWRST) SOFTWARE RESET REGISTER  Reset Value */

#define RCON_RSWRST_SWRST_Pos                 _UINT32_(0)                                          /* (RCON_RSWRST) Software Reset Trigger Position */
#define RCON_RSWRST_SWRST_Msk                 (_UINT32_(0x1) << RCON_RSWRST_SWRST_Pos)             /* (RCON_RSWRST) Software Reset Trigger Mask */
#define RCON_RSWRST_SWRST(value)              (RCON_RSWRST_SWRST_Msk & (_UINT32_(value) << RCON_RSWRST_SWRST_Pos)) /* Assigment of value for SWRST in the RCON_RSWRST register */
#define   RCON_RSWRST_SWRST_SWRST_Val         _UINT32_(0x1)                                        /* (RCON_RSWRST) Enable software reset event  */
#define   RCON_RSWRST_SWRST_NO_SWRST_Val      _UINT32_(0x0)                                        /* (RCON_RSWRST) Do not enable software reset event  */
#define RCON_RSWRST_SWRST_SWRST               (RCON_RSWRST_SWRST_SWRST_Val << RCON_RSWRST_SWRST_Pos) /* (RCON_RSWRST) Enable software reset event Position  */
#define RCON_RSWRST_SWRST_NO_SWRST            (RCON_RSWRST_SWRST_NO_SWRST_Val << RCON_RSWRST_SWRST_Pos) /* (RCON_RSWRST) Do not enable software reset event Position  */
#define RCON_RSWRST_Msk                       _UINT32_(0x00000001)                                 /* (RCON_RSWRST) Register Mask  */


/* -------- RCON_RSWRSTCLR : (RCON Offset: 0x74) (R/W 32)  -------- */
#define RCON_RSWRSTCLR_RESETVALUE             _UINT32_(0x00)                                       /*  (RCON_RSWRSTCLR)   Reset Value */

#define RCON_RSWRSTCLR_Msk                    _UINT32_(0x00000000)                                 /* (RCON_RSWRSTCLR) Register Mask  */


/* -------- RCON_RSWRSTSET : (RCON Offset: 0x78) (R/W 32)  -------- */
#define RCON_RSWRSTSET_RESETVALUE             _UINT32_(0x00)                                       /*  (RCON_RSWRSTSET)   Reset Value */

#define RCON_RSWRSTSET_Msk                    _UINT32_(0x00000000)                                 /* (RCON_RSWRSTSET) Register Mask  */


/* -------- RCON_RSWRSTINV : (RCON Offset: 0x7C) (R/W 32)  -------- */
#define RCON_RSWRSTINV_RESETVALUE             _UINT32_(0x00)                                       /*  (RCON_RSWRSTINV)   Reset Value */

#define RCON_RSWRSTINV_Msk                    _UINT32_(0x00000000)                                 /* (RCON_RSWRSTINV) Register Mask  */


/* -------- RCON_RNMICON : (RCON Offset: 0x80) (R/W 32) NMI CONTROL REGISTER -------- */
#define RCON_RNMICON_RESETVALUE               _UINT32_(0x00)                                       /*  (RCON_RNMICON) NMI CONTROL REGISTER  Reset Value */

#define RCON_RNMICON_NMICNT_Pos               _UINT32_(0)                                          /* (RCON_RNMICON) NMI Reset counter value Position */
#define RCON_RNMICON_NMICNT_Msk               (_UINT32_(0xFFFF) << RCON_RNMICON_NMICNT_Pos)        /* (RCON_RNMICON) NMI Reset counter value Mask */
#define RCON_RNMICON_NMICNT(value)            (RCON_RNMICON_NMICNT_Msk & (_UINT32_(value) << RCON_RNMICON_NMICNT_Pos)) /* Assigment of value for NMICNT in the RCON_RNMICON register */
#define   RCON_RNMICON_NMICNT_NODLY_Val       _UINT32_(0x0)                                        /* (RCON_RNMICON) No delay between NMI assertion and device reset event  */
#define   RCON_RNMICON_NMICNT_1CLKDLY_Val     _UINT32_(0x1)                                        /* (RCON_RNMICON) 1 sys_clk cycle that Software has to clear the NMI event before a device reset is performed.  */
#define   RCON_RNMICON_NMICNT_2CLKDLY_Val     _UINT32_(0x2)                                        /* (RCON_RNMICON) 2 sys_clk cycles that Software has to clear the NMI event before a device reset is performed.  */
#define   RCON_RNMICON_NMICNT_64KCLKDLY_Val   _UINT32_(0xFFFF)                                     /* (RCON_RNMICON) 65535 sys_clk cycles that Software has to clear the NMI event before a device reset is performed.  */
#define RCON_RNMICON_NMICNT_NODLY             (RCON_RNMICON_NMICNT_NODLY_Val << RCON_RNMICON_NMICNT_Pos) /* (RCON_RNMICON) No delay between NMI assertion and device reset event Position  */
#define RCON_RNMICON_NMICNT_1CLKDLY           (RCON_RNMICON_NMICNT_1CLKDLY_Val << RCON_RNMICON_NMICNT_Pos) /* (RCON_RNMICON) 1 sys_clk cycle that Software has to clear the NMI event before a device reset is performed. Position  */
#define RCON_RNMICON_NMICNT_2CLKDLY           (RCON_RNMICON_NMICNT_2CLKDLY_Val << RCON_RNMICON_NMICNT_Pos) /* (RCON_RNMICON) 2 sys_clk cycles that Software has to clear the NMI event before a device reset is performed. Position  */
#define RCON_RNMICON_NMICNT_64KCLKDLY         (RCON_RNMICON_NMICNT_64KCLKDLY_Val << RCON_RNMICON_NMICNT_Pos) /* (RCON_RNMICON) 65535 sys_clk cycles that Software has to clear the NMI event before a device reset is performed. Position  */
#define RCON_RNMICON_WDTS_Pos                 _UINT32_(16)                                         /* (RCON_RNMICON) Watch-Dog Timer Time-Out in Sleep Flag bit Position */
#define RCON_RNMICON_WDTS_Msk                 (_UINT32_(0x1) << RCON_RNMICON_WDTS_Pos)             /* (RCON_RNMICON) Watch-Dog Timer Time-Out in Sleep Flag bit Mask */
#define RCON_RNMICON_WDTS(value)              (RCON_RNMICON_WDTS_Msk & (_UINT32_(value) << RCON_RNMICON_WDTS_Pos)) /* Assigment of value for WDTS in the RCON_RNMICON register */
#define   RCON_RNMICON_WDTS_WDTS_Val          _UINT32_(0x1)                                        /* (RCON_RNMICON) WDT Time-out has occurred during sleep_mode and caused a wake-up from sleep.  */
#define   RCON_RNMICON_WDTS_NO_WDTS_Val       _UINT32_(0x0)                                        /* (RCON_RNMICON) WDT Time-out has not occurred during sleep_mode.  */
#define RCON_RNMICON_WDTS_WDTS                (RCON_RNMICON_WDTS_WDTS_Val << RCON_RNMICON_WDTS_Pos) /* (RCON_RNMICON) WDT Time-out has occurred during sleep_mode and caused a wake-up from sleep. Position  */
#define RCON_RNMICON_WDTS_NO_WDTS             (RCON_RNMICON_WDTS_NO_WDTS_Val << RCON_RNMICON_WDTS_Pos) /* (RCON_RNMICON) WDT Time-out has not occurred during sleep_mode. Position  */
#define RCON_RNMICON_CF_Pos                   _UINT32_(17)                                         /* (RCON_RNMICON) Clock Fail Detect bit Position */
#define RCON_RNMICON_CF_Msk                   (_UINT32_(0x1) << RCON_RNMICON_CF_Pos)               /* (RCON_RNMICON) Clock Fail Detect bit Mask */
#define RCON_RNMICON_CF(value)                (RCON_RNMICON_CF_Msk & (_UINT32_(value) << RCON_RNMICON_CF_Pos)) /* Assigment of value for CF in the RCON_RNMICON register */
#define   RCON_RNMICON_CF_CFAIL_Val           _UINT32_(0x1)                                        /* (RCON_RNMICON) FSCM has detected clock failure and caused an NMI  */
#define   RCON_RNMICON_CF_NO_FAILDET_Val      _UINT32_(0x0)                                        /* (RCON_RNMICON) FSCM has not detected clock failure  */
#define RCON_RNMICON_CF_CFAIL                 (RCON_RNMICON_CF_CFAIL_Val << RCON_RNMICON_CF_Pos)   /* (RCON_RNMICON) FSCM has detected clock failure and caused an NMI Position  */
#define RCON_RNMICON_CF_NO_FAILDET            (RCON_RNMICON_CF_NO_FAILDET_Val << RCON_RNMICON_CF_Pos) /* (RCON_RNMICON) FSCM has not detected clock failure Position  */
#define RCON_RNMICON_LVD_Pos                  _UINT32_(18)                                         /* (RCON_RNMICON) Programmable Low Voltage Detect Event Position */
#define RCON_RNMICON_LVD_Msk                  (_UINT32_(0x1) << RCON_RNMICON_LVD_Pos)              /* (RCON_RNMICON) Programmable Low Voltage Detect Event Mask */
#define RCON_RNMICON_LVD(value)               (RCON_RNMICON_LVD_Msk & (_UINT32_(value) << RCON_RNMICON_LVD_Pos)) /* Assigment of value for LVD in the RCON_RNMICON register */
#define   RCON_RNMICON_LVD_LVD_Val            _UINT32_(0x1)                                        /* (RCON_RNMICON) PLVD has detected a low voltage condition and caused an NMI  */
#define   RCON_RNMICON_LVD_NO_LVD_Val         _UINT32_(0x0)                                        /* (RCON_RNMICON) PLVD has not detected a low voltage condition  */
#define RCON_RNMICON_LVD_LVD                  (RCON_RNMICON_LVD_LVD_Val << RCON_RNMICON_LVD_Pos)   /* (RCON_RNMICON) PLVD has detected a low voltage condition and caused an NMI Position  */
#define RCON_RNMICON_LVD_NO_LVD               (RCON_RNMICON_LVD_NO_LVD_Val << RCON_RNMICON_LVD_Pos) /* (RCON_RNMICON) PLVD has not detected a low voltage condition Position  */
#define RCON_RNMICON_GNMI_Pos                 _UINT32_(19)                                         /* (RCON_RNMICON) External / Generic NMI Event Position */
#define RCON_RNMICON_GNMI_Msk                 (_UINT32_(0x1) << RCON_RNMICON_GNMI_Pos)             /* (RCON_RNMICON) External / Generic NMI Event Mask */
#define RCON_RNMICON_GNMI(value)              (RCON_RNMICON_GNMI_Msk & (_UINT32_(value) << RCON_RNMICON_GNMI_Pos)) /* Assigment of value for GNMI in the RCON_RNMICON register */
#define   RCON_RNMICON_GNMI_NMI_Val           _UINT32_(0x1)                                        /* (RCON_RNMICON) A general NMI event has been detected and caused an NMI  */
#define   RCON_RNMICON_GNMI_NO_NMI_Val        _UINT32_(0x0)                                        /* (RCON_RNMICON) A general NMI event has not been detected.  */
#define RCON_RNMICON_GNMI_NMI                 (RCON_RNMICON_GNMI_NMI_Val << RCON_RNMICON_GNMI_Pos) /* (RCON_RNMICON) A general NMI event has been detected and caused an NMI Position  */
#define RCON_RNMICON_GNMI_NO_NMI              (RCON_RNMICON_GNMI_NO_NMI_Val << RCON_RNMICON_GNMI_Pos) /* (RCON_RNMICON) A general NMI event has not been detected. Position  */
#define RCON_RNMICON_SWNMI_Pos                _UINT32_(23)                                         /* (RCON_RNMICON) Software NMI Trigger Position */
#define RCON_RNMICON_SWNMI_Msk                (_UINT32_(0x1) << RCON_RNMICON_SWNMI_Pos)            /* (RCON_RNMICON) Software NMI Trigger Mask */
#define RCON_RNMICON_SWNMI(value)             (RCON_RNMICON_SWNMI_Msk & (_UINT32_(value) << RCON_RNMICON_SWNMI_Pos)) /* Assigment of value for SWNMI in the RCON_RNMICON register */
#define   RCON_RNMICON_SWNMI_SWNMI_Val        _UINT32_(0x1)                                        /* (RCON_RNMICON) Writing a 1 to this bit will cause an NMI to be generated  */
#define   RCON_RNMICON_SWNMI_NO_SWNMI_Val     _UINT32_(0x0)                                        /* (RCON_RNMICON) Writing a 0 to this bit will have no effect.  */
#define RCON_RNMICON_SWNMI_SWNMI              (RCON_RNMICON_SWNMI_SWNMI_Val << RCON_RNMICON_SWNMI_Pos) /* (RCON_RNMICON) Writing a 1 to this bit will cause an NMI to be generated Position  */
#define RCON_RNMICON_SWNMI_NO_SWNMI           (RCON_RNMICON_SWNMI_NO_SWNMI_Val << RCON_RNMICON_SWNMI_Pos) /* (RCON_RNMICON) Writing a 0 to this bit will have no effect. Position  */
#define RCON_RNMICON_WDTR_Pos                 _UINT32_(24)                                         /* (RCON_RNMICON) Watchdog Timer Time-Out in Run Flag bit Position */
#define RCON_RNMICON_WDTR_Msk                 (_UINT32_(0x1) << RCON_RNMICON_WDTR_Pos)             /* (RCON_RNMICON) Watchdog Timer Time-Out in Run Flag bit Mask */
#define RCON_RNMICON_WDTR(value)              (RCON_RNMICON_WDTR_Msk & (_UINT32_(value) << RCON_RNMICON_WDTR_Pos)) /* Assigment of value for WDTR in the RCON_RNMICON register */
#define   RCON_RNMICON_WDTR_WDTR_Val          _UINT32_(0x1)                                        /* (RCON_RNMICON) WDT Time-out has occurred and caused a NMI.  */
#define   RCON_RNMICON_WDTR_NO_WDTR_Val       _UINT32_(0x0)                                        /* (RCON_RNMICON) WDT Time-out has not occurred.  */
#define RCON_RNMICON_WDTR_WDTR                (RCON_RNMICON_WDTR_WDTR_Val << RCON_RNMICON_WDTR_Pos) /* (RCON_RNMICON) WDT Time-out has occurred and caused a NMI. Position  */
#define RCON_RNMICON_WDTR_NO_WDTR             (RCON_RNMICON_WDTR_NO_WDTR_Val << RCON_RNMICON_WDTR_Pos) /* (RCON_RNMICON) WDT Time-out has not occurred. Position  */
#define RCON_RNMICON_DMTO_Pos                 _UINT32_(25)                                         /* (RCON_RNMICON) Deadman Timer Time-Out Flag bit Position */
#define RCON_RNMICON_DMTO_Msk                 (_UINT32_(0x1) << RCON_RNMICON_DMTO_Pos)             /* (RCON_RNMICON) Deadman Timer Time-Out Flag bit Mask */
#define RCON_RNMICON_DMTO(value)              (RCON_RNMICON_DMTO_Msk & (_UINT32_(value) << RCON_RNMICON_DMTO_Pos)) /* Assigment of value for DMTO in the RCON_RNMICON register */
#define   RCON_RNMICON_DMTO_DMTO_Val          _UINT32_(0x1)                                        /* (RCON_RNMICON) DMT Time-out has occurred and caused a NMI.  */
#define   RCON_RNMICON_DMTO_NO_DMTO_Val       _UINT32_(0x0)                                        /* (RCON_RNMICON) DMT Time-out has not occurred.  */
#define RCON_RNMICON_DMTO_DMTO                (RCON_RNMICON_DMTO_DMTO_Val << RCON_RNMICON_DMTO_Pos) /* (RCON_RNMICON) DMT Time-out has occurred and caused a NMI. Position  */
#define RCON_RNMICON_DMTO_NO_DMTO             (RCON_RNMICON_DMTO_NO_DMTO_Val << RCON_RNMICON_DMTO_Pos) /* (RCON_RNMICON) DMT Time-out has not occurred. Position  */
#define RCON_RNMICON_Msk                      _UINT32_(0x038FFFFF)                                 /* (RCON_RNMICON) Register Mask  */


/* -------- RCON_RNMICONCLR : (RCON Offset: 0x84) (R/W 32)  -------- */
#define RCON_RNMICONCLR_RESETVALUE            _UINT32_(0x00)                                       /*  (RCON_RNMICONCLR)   Reset Value */

#define RCON_RNMICONCLR_Msk                   _UINT32_(0x00000000)                                 /* (RCON_RNMICONCLR) Register Mask  */


